zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_sent.h
/**
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_sent.h
  * @author  FMSH Application Team
  * @brief   Head file of SENT FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_SENT_H
#define __FM33FG0XXA_FL_SENT_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup SENT_FL_ES_INIT SENT Exported Init structures
  * @{
  */

/**
  * @brief FL SENT Init Sturcture definition
  */
typedef struct
{
    /*配置接收发送*/
    uint32_t transferDirection;
    /*时钟预分频*/
    uint32_t prescaler;
    /*发送模式*/
    uint32_t transmitMode;
    /*数据Nibble个数*/
    uint32_t dataNibbleNumber;
    /*硬件CRC*/
    uint32_t hardwareCRC;
    /*CRC模式*/
    uint32_t CRCMode;
    /*暂停脉冲*/
    uint32_t pausePulse;
    /*发送帧长度*/
    uint32_t frameTime;
    /*空闲时输出电平*/
    uint32_t idleoutputpulse;
    /*sync长度范围最大值*/
    uint32_t syncPulseMax;
    /*sync长度范围最小值*/
    uint32_t syncPulseMin;
} FL_SENT_InitTypeDef;


/**
  * @brief    
  */
typedef enum
{
    FL_SENT_NIBBLE_STATUS,
    FL_SENT_NIBBLE_DATA_1ST,
    FL_SENT_NIBBLE_DATA_2ST,
    FL_SENT_NIBBLE_DATA_3ST,
    FL_SENT_NIBBLE_DATA_4ST,
    FL_SENT_NIBBLE_DATA_5ST,
    FL_SENT_NIBBLE_DATA_6ST,
    FL_SENT_NIBBLE_CRC
}fl_sent_nib_type;
/**
  * @brief    
  */
typedef enum
{
    FL_SENT_PAUSESTATUS_NO_TXANDRX,
    FL_SENT_PAUSESTATUS_TXANDRX
}fl_sent_pause_type;

/**
  * @brief    
  */
typedef enum
{
    FL_SENT_SYNCSTATUS_NO_TXANDRX,
    FL_SENT_SYNCSTATUS_TXANDRX
}fl_sent_sync_type;


/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup SENT_FL_Exported_Constants SENT Exported Constants
  * @{
  */

#define    SENT_CR_RXEN_Pos                                       (1U)
#define    SENT_CR_RXEN_Msk                                       (0x1U << SENT_CR_RXEN_Pos)
#define    SENT_CR_RXEN                                           SENT_CR_RXEN_Msk

#define    SENT_CR_TXEN_Pos                                       (0U)
#define    SENT_CR_TXEN_Msk                                       (0x1U << SENT_CR_TXEN_Pos)
#define    SENT_CR_TXEN                                           SENT_CR_TXEN_Msk

#define    SENT_CFGR_FTXIE_Pos                                    (21U)
#define    SENT_CFGR_FTXIE_Msk                                    (0x1U << SENT_CFGR_FTXIE_Pos)
#define    SENT_CFGR_FTXIE                                        SENT_CFGR_FTXIE_Msk

#define    SENT_CFGR_NTXIE_Pos                                    (20U)
#define    SENT_CFGR_NTXIE_Msk                                    (0x1U << SENT_CFGR_NTXIE_Pos)
#define    SENT_CFGR_NTXIE                                        SENT_CFGR_NTXIE_Msk

#define    SENT_CFGR_SYNCIE_Pos                                   (19U)
#define    SENT_CFGR_SYNCIE_Msk                                   (0x1U << SENT_CFGR_SYNCIE_Pos)
#define    SENT_CFGR_SYNCIE                                       SENT_CFGR_SYNCIE_Msk

#define    SENT_CFGR_ERRIE_Pos                                    (18U)
#define    SENT_CFGR_ERRIE_Msk                                    (0x1U << SENT_CFGR_ERRIE_Pos)
#define    SENT_CFGR_ERRIE                                        SENT_CFGR_ERRIE_Msk

