zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_sent.h
#define    SENT_CFGR_FRXIE_Pos                                    (17U)
#define    SENT_CFGR_FRXIE_Msk                                    (0x1U << SENT_CFGR_FRXIE_Pos)
#define    SENT_CFGR_FRXIE                                        SENT_CFGR_FRXIE_Msk

#define    SENT_CFGR_NRXIE_Pos                                    (16U)
#define    SENT_CFGR_NRXIE_Msk                                    (0x1U << SENT_CFGR_NRXIE_Pos)
#define    SENT_CFGR_NRXIE                                        SENT_CFGR_NRXIE_Msk

#define    SENT_CFGR_NIBCNT_Pos                                   (8U)
#define    SENT_CFGR_NIBCNT_Msk                                   (0x7U << SENT_CFGR_NIBCNT_Pos)
#define    SENT_CFGR_NIBCNT                                       SENT_CFGR_NIBCNT_Msk

#define    SENT_CFGR_CRCM_Pos                                     (5U)
#define    SENT_CFGR_CRCM_Msk                                     (0x1U << SENT_CFGR_CRCM_Pos)
#define    SENT_CFGR_CRCM                                         SENT_CFGR_CRCM_Msk

#define    SENT_CFGR_PPEN_Pos                                     (4U)
#define    SENT_CFGR_PPEN_Msk                                     (0x1U << SENT_CFGR_PPEN_Pos)
#define    SENT_CFGR_PPEN                                         SENT_CFGR_PPEN_Msk

#define    SENT_CFGR_CRCEN_Pos                                    (3U)
#define    SENT_CFGR_CRCEN_Msk                                    (0x1U << SENT_CFGR_CRCEN_Pos)
#define    SENT_CFGR_CRCEN                                        SENT_CFGR_CRCEN_Msk

#define    SENT_CFGR_TXPOL_Pos                                    (2U)
#define    SENT_CFGR_TXPOL_Msk                                    (0x1U << SENT_CFGR_TXPOL_Pos)
#define    SENT_CFGR_TXPOL                                        SENT_CFGR_TXPOL_Msk

#define    SENT_CFGR_TXM_Pos                                      (1U)
#define    SENT_CFGR_TXM_Msk                                      (0x1U << SENT_CFGR_TXM_Pos)
#define    SENT_CFGR_TXM                                          SENT_CFGR_TXM_Msk

#define    SENT_CFGR_MOD_Pos                                      (0U)
#define    SENT_CFGR_MOD_Msk                                      (0x1U << SENT_CFGR_MOD_Pos)
#define    SENT_CFGR_MOD                                          SENT_CFGR_MOD_Msk

#define    SENT_PSR_PRESCALER_Pos                                 (0U)
#define    SENT_PSR_PRESCALER_Msk                                 (0xffffU << SENT_PSR_PRESCALER_Pos)
#define    SENT_PSR_PRESCALER                                     SENT_PSR_PRESCALER_Msk

#define    SENT_FTR_FRAMETIME_Pos                                 (0U)
#define    SENT_FTR_FRAMETIME_Msk                                 (0xfffU << SENT_FTR_FRAMETIME_Pos)
#define    SENT_FTR_FRAMETIME                                     SENT_FTR_FRAMETIME_Msk

#define    SENT_SR_NIB_Pos                                        (19U)
#define    SENT_SR_NIB_Msk                                        (0x7U << SENT_SR_NIB_Pos)
#define    SENT_SR_NIB                                            SENT_SR_NIB_Msk

#define    SENT_SR_RXIDLE_Pos                                     (18U)
#define    SENT_SR_RXIDLE_Msk                                     (0x1U << SENT_SR_RXIDLE_Pos)
#define    SENT_SR_RXIDLE                                         SENT_SR_RXIDLE_Msk

#define    SENT_SR_PAUSE_Pos                                      (17U)
#define    SENT_SR_PAUSE_Msk                                      (0x1U << SENT_SR_PAUSE_Pos)
#define    SENT_SR_PAUSE                                          SENT_SR_PAUSE_Msk

#define    SENT_SR_SYNC_Pos                                       (16U)
#define    SENT_SR_SYNC_Msk                                       (0x1U << SENT_SR_SYNC_Pos)
#define    SENT_SR_SYNC                                           SENT_SR_SYNC_Msk

#define    SENT_SR_TCOERR_Pos                                     (13U)
#define    SENT_SR_TCOERR_Msk                                     (0x1U << SENT_SR_TCOERR_Pos)
#define    SENT_SR_TCOERR                                         SENT_SR_TCOERR_Msk

#define    SENT_SR_SSERR_Pos                                      (12U)
#define    SENT_SR_SSERR_Msk                                      (0x1U << SENT_SR_SSERR_Pos)
#define    SENT_SR_SSERR                                          SENT_SR_SSERR_Msk

#define    SENT_SR_NBERR_Pos                                      (11U)
#define    SENT_SR_NBERR_Msk                                      (0x1U << SENT_SR_NBERR_Pos)
#define    SENT_SR_NBERR                                          SENT_SR_NBERR_Msk

#define    SENT_SR_CRCERR_Pos                                     (10U)
#define    SENT_SR_CRCERR_Msk                                     (0x1U << SENT_SR_CRCERR_Pos)
#define    SENT_SR_CRCERR                                         SENT_SR_CRCERR_Msk

#define    SENT_SR_NCNTERR_Pos                                    (9U)
#define    SENT_SR_NCNTERR_Msk                                    (0x1U << SENT_SR_NCNTERR_Pos)
#define    SENT_SR_NCNTERR                                        SENT_SR_NCNTERR_Msk

#define    SENT_SR_SYNCERR_Pos                                    (8U)
#define    SENT_SR_SYNCERR_Msk                                    (0x1U << SENT_SR_SYNCERR_Pos)
#define    SENT_SR_SYNCERR                                        SENT_SR_SYNCERR_Msk

#define    SENT_SR_FTXF_Pos                                       (5U)
#define    SENT_SR_FTXF_Msk                                       (0x1U << SENT_SR_FTXF_Pos)
#define    SENT_SR_FTXF                                           SENT_SR_FTXF_Msk

#define    SENT_SR_NTXF_Pos                                       (4U)
#define    SENT_SR_NTXF_Msk                                       (0x1U << SENT_SR_NTXF_Pos)
#define    SENT_SR_NTXF                                           SENT_SR_NTXF_Msk

#define    SENT_SR_SYNCF_Pos                                      (3U)
#define    SENT_SR_SYNCF_Msk                                      (0x1U << SENT_SR_SYNCF_Pos)
#define    SENT_SR_SYNCF                                          SENT_SR_SYNCF_Msk

#define    SENT_SR_FRXF_Pos                                       (1U)
#define    SENT_SR_FRXF_Msk                                       (0x1U << SENT_SR_FRXF_Pos)
#define    SENT_SR_FRXF                                           SENT_SR_FRXF_Msk

#define    SENT_SR_NRXF_Pos                                       (0U)
#define    SENT_SR_NRXF_Msk                                       (0x1U << SENT_SR_NRXF_Pos)
#define    SENT_SR_NRXF                                           SENT_SR_NRXF_Msk

#define    SENT_DR_CRC_Pos                                        (28U)
#define    SENT_DR_CRC_Msk                                        (0xfU << SENT_DR_CRC_Pos)
#define    SENT_DR_CRC                                            SENT_DR_CRC_Msk

#define    SENT_DR_DATA6_Pos                                      (24U)
#define    SENT_DR_DATA6_Msk                                      (0xfU << SENT_DR_DATA6_Pos)
#define    SENT_DR_DATA6                                          SENT_DR_DATA6_Msk

#define    SENT_DR_DATA5_Pos                                      (20U)
#define    SENT_DR_DATA5_Msk                                      (0xfU << SENT_DR_DATA5_Pos)
#define    SENT_DR_DATA5                                          SENT_DR_DATA5_Msk

#define    SENT_DR_DATA4_Pos                                      (16U)
#define    SENT_DR_DATA4_Msk                                      (0xfU << SENT_DR_DATA4_Pos)
#define    SENT_DR_DATA4                                          SENT_DR_DATA4_Msk

#define    SENT_DR_DATA3_Pos                                      (12U)
#define    SENT_DR_DATA3_Msk                                      (0xfU << SENT_DR_DATA3_Pos)
#define    SENT_DR_DATA3                                          SENT_DR_DATA3_Msk

