zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_sent.h
#define    SENT_DR_DATA2_Pos                                      (8U)
#define    SENT_DR_DATA2_Msk                                      (0xfU << SENT_DR_DATA2_Pos)
#define    SENT_DR_DATA2                                          SENT_DR_DATA2_Msk

#define    SENT_DR_DATA1_Pos                                      (4U)
#define    SENT_DR_DATA1_Msk                                      (0xfU << SENT_DR_DATA1_Pos)
#define    SENT_DR_DATA1                                          SENT_DR_DATA1_Msk

#define    SENT_DR_STATUS_Pos                                     (0U)
#define    SENT_DR_STATUS_Msk                                     (0xfU << SENT_DR_STATUS_Pos)
#define    SENT_DR_STATUS                                         SENT_DR_STATUS_Msk

#define    SENT_SYNC_SYNCMAX_Pos                                  (16U)
#define    SENT_SYNC_SYNCMAX_Msk                                  (0xfffU << SENT_SYNC_SYNCMAX_Pos)
#define    SENT_SYNC_SYNCMAX                                      SENT_SYNC_SYNCMAX_Msk

#define    SENT_SYNC_SYNCMIN_Pos                                  (0U)
#define    SENT_SYNC_SYNCMIN_Msk                                  (0xfffU << SENT_SYNC_SYNCMIN_Pos)
#define    SENT_SYNC_SYNCMIN                                      SENT_SYNC_SYNCMIN_Msk

#define    SENT_RCAL_BASECNT_Pos                                  (16U)
#define    SENT_RCAL_BASECNT_Msk                                  (0x3fU << SENT_RCAL_BASECNT_Pos)
#define    SENT_RCAL_BASECNT                                      SENT_RCAL_BASECNT_Msk

#define    SENT_RCAL_RCAL_Pos                                     (0U)
#define    SENT_RCAL_RCAL_Msk                                     (0xfffU << SENT_RCAL_RCAL_Pos)
#define    SENT_RCAL_RCAL                                         SENT_RCAL_RCAL_Msk


#define    FL_SENT_DATANIBBLES_COUNT_1N                           (0x1U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_2N                           (0x2U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_3N                           (0x3U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_4N                           (0x4U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_5N                           (0x5U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_6N                           (0x6U << SENT_CFGR_NIBCNT_Pos)

#define    FL_SENT_CRCMODE_RECOMMENDED                            (0x0U << SENT_CFGR_CRCM_Pos)
#define    FL_SENT_CRCMODE_LEGACY                                 (0x1U << SENT_CFGR_CRCM_Pos)

#define    FL_SENT_IDLEOUTPUT_HIGH                                (0x0U << SENT_CFGR_TXPOL_Pos)
#define    FL_SENT_IDLEOUTPUT_LOW                                 (0x1U << SENT_CFGR_TXPOL_Pos)

#define    FL_SENT_TXMODE_SOFTWARE                                (0x0U << SENT_CFGR_TXM_Pos)
#define    FL_SENT_TXMODE_SERIAL                                  (0x1U << SENT_CFGR_TXM_Pos)

#define    FL_SENT_MODE_RX                                        (0x0U << SENT_CFGR_MOD_Pos)
#define    FL_SENT_MODE_TX                                        (0x1U << SENT_CFGR_MOD_Pos)

#define    FL_SENT_NIBBLE_STATUS                                  (0x0U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_1ST                                (0x1U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_2ST                                (0x2U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_3ST                                (0x3U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_4ST                                (0x4U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_5ST                                (0x5U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_6ST                                (0x6U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_CRC                                     (0x7U << SENT_SR_NIB_Pos)

#define    FL_SENT_PAUSESTATUS_TXANDRX                             0x1U
#define    FL_SENT_PAUSESTATUS_NO_TXANDRX                          0x0U

#define    FL_SENT_SYNCSTATUS_TXANDRX                              0x1U
#define    FL_SENT_SYNCSTATUS_NO_TXANDRX                           0x0U

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup SENT_FL_Exported_Functions SENT Exported Functions
  * @{
  */

/**
  * @brief    SENT receive enable  
  * @rmtoll   CR    RXEN    FL_SENT_EnableRX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableRX(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CR, SENT_CR_RXEN_Msk);
}

/**
  * @brief    SENT receive disable  
  * @rmtoll   CR    RXEN    FL_SENT_DisableRX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableRX(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CR, SENT_CR_RXEN_Msk);
}

/**
  * @brief    Get SENT receive enable status
  * @rmtoll   CR    RXEN    FL_SENT_IsEnableRX
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnableRX(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CR, SENT_CR_RXEN_Msk) == SENT_CR_RXEN_Msk);
}

/**
  * @brief    SENT transmit enable  
  * @rmtoll   CR    TXEN    FL_SENT_EnableTX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableTX(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CR, SENT_CR_TXEN_Msk);
}

/**
  * @brief    SENT transmit disable  
  * @rmtoll   CR    TXEN    FL_SENT_DisableTX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableTX(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CR, SENT_CR_TXEN_Msk);
}

/**
  * @brief    Get SENT transmit enable status  
  * @rmtoll   CR    TXEN    FL_SENT_IsEnableTX
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnableTX(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CR, SENT_CR_TXEN_Msk) == SENT_CR_TXEN_Msk);
}

/**
  * @brief    Enable SENT Frame Send complete interrupt 
  * @rmtoll   CFGR    FTXIE    FL_SENT_EnableIT_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_FrameTransmitComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_FTXIE_Msk);
}

/**
  * @brief    Disable SENT Frame Send complete interrupt 
  * @rmtoll   CFGR    FTXIE    FL_SENT_DisableIT_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_FrameTransmitComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_FTXIE_Msk);
}

/**
  * @brief    Get SENT Frame Send complete interrupt State 
  * @rmtoll   CFGR    FTXIE    FL_SENT_IsEnabledIT_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_FrameTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_FTXIE_Msk) == SENT_CFGR_FTXIE_Msk);
}

/**
  * @brief    Enable SENT Nibble Send completion interrupt 
  * @rmtoll   CFGR    NTXIE    FL_SENT_EnableIT_NibbleTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_NibbleTransmitComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_NTXIE_Msk);
}

/**
  * @brief    Disable SENT Nibble Send completion interrupt
  * @rmtoll   CFGR    NTXIE    FL_SENT_DisableIT_NibbleTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_NibbleTransmitComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_NTXIE_Msk);
}

/**
  * @brief    Get SENT Nibble Send completion interrupt State
  * @rmtoll   CFGR    NTXIE    FL_SENT_IsEnabledIT_NibbleTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_NibbleTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_NTXIE_Msk) == SENT_CFGR_NTXIE_Msk);
}

/**
  * @brief    Enable SENT Sync pulse Interrupt 
  * @rmtoll   CFGR    SYNCIE    FL_SENT_EnableIT_SyncPulseReceiveCorrectly
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_SyncPulseReceiveCorrectly(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_SYNCIE_Msk);
}

/**
  * @brief    Disable SENT Sync pulse Interrup
  * @rmtoll   CFGR    SYNCIE    FL_SENT_DisableIT_SyncPulseReceiveCorrectly
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_SyncPulseReceiveCorrectly(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_SYNCIE_Msk);
}

/**
  * @brief    Get SENT Sync pulse Interrup State
  * @rmtoll   CFGR    SYNCIE    FL_SENT_IsEnabledIT_SyncPulseReceiveCorrectly
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_SyncPulseReceiveCorrectly(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_SYNCIE_Msk) == SENT_CFGR_SYNCIE_Msk);
}

/**
  * @brief    Enable SENT Error event interrupt
  * @rmtoll   CFGR    ERRIE    FL_SENT_EnableIT_ErrEventsOccurred
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_ErrEventsOccurred(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_ERRIE_Msk);
}

/**
  * @brief    Disable SENT Error event interrupt
  * @rmtoll   CFGR    ERRIE    FL_SENT_DisableIT_ErrEventsOccurred
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_ErrEventsOccurred(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_ERRIE_Msk);
}

/**
  * @brief    Get SENT Error event interrupt State
  * @rmtoll   CFGR    ERRIE    FL_SENT_IsEnabledIT_ErrEventsOccurred
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_ErrEventsOccurred(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_ERRIE_Msk) == SENT_CFGR_ERRIE_Msk);
}

/**
  * @brief    Enable SENT Frame receives complete interrupt
  * @rmtoll   CFGR    FRXIE    FL_SENT_EnableIT_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_FrameReceiveComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_FRXIE_Msk);
}

/**
  * @brief    Disable SENT Frame receives complete interrupt
  * @rmtoll   CFGR    FRXIE    FL_SENT_DisableIT_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_FrameReceiveComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_FRXIE_Msk);
}

/**
  * @brief    Get SENT Frame receives complete interrupt State
  * @rmtoll   CFGR    FRXIE    FL_SENT_IsEnabledIT_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_FrameReceiveComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_FRXIE_Msk) == SENT_CFGR_FRXIE_Msk);
}

/**
  * @brief    Enable SENT Nibble Receiving completion interrupt
  * @rmtoll   CFGR    NRXIE    FL_SENT_EnableIT_NibbleReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_NibbleReceiveComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_NRXIE_Msk);
}

/**
  * @brief    Disable SENT Nibble Receiving completion interrupt
  * @rmtoll   CFGR    NRXIE    FL_SENT_DisableIT_NibbleReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_NibbleReceiveComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_NRXIE_Msk);
}

/**
  * @brief    Get SENT Nibble Receiving completion interrupt State
  * @rmtoll   CFGR    NRXIE    FL_SENT_IsEnabledIT_NibbleReceiveComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_NibbleReceiveComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_NRXIE_Msk) == SENT_CFGR_NRXIE_Msk);
}

/**
  * @brief    Set Number of Data Nibbles in the frame
  * @rmtoll   CFGR    NIBCNT    FL_SENT_SetDataNibblesCount
  * @param    SENTx SENT instance
  * @param    nibblecount This parameter can be one of the following values:
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_1N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_2N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_3N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_4N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_5N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_6N
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetDataNibblesCount(SENT_Type* SENTx, uint32_t nibblecount)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_NIBCNT_Msk, nibblecount);
}

/**
  * @brief    Get Number of Data Nibbles in the frame
  * @rmtoll   CFGR    NIBCNT    FL_SENT_GetDataNibblesCount
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_1N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_2N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_3N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_4N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_5N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_6N
  */
__STATIC_INLINE uint32_t FL_SENT_GetDataNibblesCount(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_NIBCNT_Msk) >> SENT_CFGR_NIBCNT_Pos);
}

/**
  * @brief    Set CRC mode selection
  * @rmtoll   CFGR    CRCM    FL_SENT_SetCRCModeSelect
  * @param    SENTx SENT instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SENT_CRCMODE_RECOMMENDED
  *           @arg @ref FL_SENT_CRCMODE_LEGACY
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetCRCModeSelect(SENT_Type* SENTx, uint32_t mode)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_CRCM_Msk, mode);
}

/**
  * @brief    Get CRC mode selection
  * @rmtoll   CFGR    CRCM    FL_SENT_GetCRCModeSelect
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_CRCMODE_RECOMMENDED
  *           @arg @ref FL_SENT_CRCMODE_LEGACY
  */
__STATIC_INLINE uint32_t FL_SENT_GetCRCModeSelect(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_CRCM_Msk));
}

/**
  * @brief    Enable Pause pulse
  * @rmtoll   CFGR    PPEN    FL_SENT_EnablePausePulse
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnablePausePulse(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_PPEN_Msk);
}

/**
  * @brief    Disable Pause pulse
  * @rmtoll   CFGR    PPEN    FL_SENT_DisablePausePulse
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisablePausePulse(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_PPEN_Msk);
}

/**
  * @brief    Get Pause pulse State
  * @rmtoll   CFGR    PPEN    FL_SENT_IsEnabledPausePulse
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledPausePulse(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_PPEN_Msk) == SENT_CFGR_PPEN_Msk);
}

/**
  * @brief    Enable Hardware CRC
  * @rmtoll   CFGR    CRCEN    FL_SENT_EnableCRCHardware
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableCRCHardware(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_CRCEN_Msk);
}

/**
  * @brief    Disable Hardware CRC
  * @rmtoll   CFGR    CRCEN    FL_SENT_DisableCRCHardware
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableCRCHardware(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_CRCEN_Msk);
}

/**
  * @brief    Get Hardware CRC State
  * @rmtoll   CFGR    CRCEN    FL_SENT_IsEnabledCRCHardware
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledCRCHardware(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_CRCEN_Msk) == SENT_CFGR_CRCEN_Msk);
}

/**
  * @brief    Set the output level in the transmission idle state 
  * @rmtoll   CFGR    TXPOL    FL_SENT_SetIdleTXOutputPulse
  * @param    SENTx SENT instance
  * @param    pulse This parameter can be one of the following values:
  *           @arg @ref FL_SENT_OUTPUT_HIGH
  *           @arg @ref FL_SENT_OUTPUT_LOW
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetIdleTXOutputPulse(SENT_Type* SENTx, uint32_t pulse)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_TXPOL_Msk, pulse);
}

/**
  * @brief    Get the output level in the transmission idle state
  * @rmtoll   CFGR    TXPOL    FL_SENT_GetIdleTXOutputPulse
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_OUTPUT_HIGH
  *           @arg @ref FL_SENT_OUTPUT_LOW
  */
__STATIC_INLINE uint32_t FL_SENT_GetIdleTXOutputPulse(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_TXPOL_Msk));
}

/**
  * @brief    Set transmit mode
  * @rmtoll   CFGR    TXM    FL_SENT_SetTXModeSelect
  * @param    SENTx SENT instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SENT_TXMODE_SOFTWARE
  *           @arg @ref FL_SENT_TXMODE_SERIAL
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetTXModeSelect(SENT_Type* SENTx, uint32_t mode)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_TXM_Msk, mode);
}

/**
  * @brief    Get transmit mode
  * @rmtoll   CFGR    TXM    FL_SENT_GetTXModeSelect
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_TXMODE_SOFTWARE
  *           @arg @ref FL_SENT_TXMODE_SERIAL
  */
__STATIC_INLINE uint32_t FL_SENT_GetTXModeSelect(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_TXM_Msk));
}

/**
  * @brief    Set SENT work mode
  * @rmtoll   CFGR    MOD    FL_SENT_SetModeSelect
  * @param    SENTx SENT instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SENT_MODE_RX
  *           @arg @ref FL_SENT_MODE_TX
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetModeSelect(SENT_Type* SENTx, uint32_t mode)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_MOD_Msk, mode);
}

/**
  * @brief    Get SENT work mode
  * @rmtoll   CFGR    MOD    FL_SENT_GetModeSelect
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_MODE_RX
  *           @arg @ref FL_SENT_MODE_TX
  */
__STATIC_INLINE uint32_t FL_SENT_GetModeSelect(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_MOD_Msk));
}

/**
  * @brief    Write SENT clock Prescaler
  * @rmtoll   PSR    PRESCALER    FL_SENT_WritePrescaler
  * @param    SENTx SENT instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WritePrescaler(SENT_Type* SENTx, uint32_t psc)
{
    MODIFY_REG(SENTx->PSR, (0xffffU << 0U), (psc << 0U));
}

/**
  * @brief    Read SENT clock Prescaler
  * @rmtoll   PSR    PRESCALER    FL_SENT_ReadPrescaler
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadPrescaler(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->PSR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Write Send frame length
  * @rmtoll   FTR    FRAMETIME    FL_SENT_WriteFrameTimeLength
  * @param    SENTx SENT instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteFrameTimeLength(SENT_Type* SENTx, uint32_t length)
{
    MODIFY_REG(SENTx->FTR, (0xfffU << 0U), (length << 0U));
}

/**
  * @brief    Read Send frame length
  * @rmtoll   FTR    FRAMETIME    FL_SENT_ReadFrameTimeLength
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadFrameTimeLength(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->FTR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get Nibble Transmit and Receive status
  * @rmtoll   SR    NIB    FL_SENT_GetTransmitAndReceiveNibbleStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_NIBBLE_STATUS
  *           @arg @ref FL_SENT_NIBBLE_DATA_1ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_2ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_3ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_4ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_5ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_6ST
  *           @arg @ref FL_SENT_NIBBLE_CRC
  */
__STATIC_INLINE uint32_t FL_SENT_GetTransmitAndReceiveNibbleStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NIB_Msk) >> SENT_SR_NIB_Pos);
}

/**
  * @brief    Get Receive Idle status
  * @rmtoll   SR    RXIDLE    FL_SENT_GetRxdleStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_SENT_GetRxdleStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_RXIDLE_Msk) >> SENT_SR_RXIDLE_Pos);
}

/**
  * @brief    Get Nibble Transmit and Receive Pause status
  * @rmtoll   SR    PAUSE    FL_SENT_GetTransmitAndReceivePauseStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_PAUSESTATUS_TXANDRX
  *           @arg @ref FL_SENT_PAUSESTATUS_NO_TXANDRX
  */
__STATIC_INLINE uint32_t FL_SENT_GetTransmitAndReceivePauseStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_PAUSE_Msk) >> SENT_SR_PAUSE_Pos);
}

/**
  * @brief    Get Nibble Transmit and Receive Sync status
  * @rmtoll   SR    SYNC    FL_SENT_GetTransmitAndReceiveSyncStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_SYNCSTATUS_TXANDRX
  *           @arg @ref FL_SENT_SYNCSTATUS_NO_TXANDRX
  */
__STATIC_INLINE uint32_t FL_SENT_GetTransmitAndReceiveSyncStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_SYNC_Msk) >> SENT_SR_SYNC_Pos);
}

/**
  * @brief    Get Tick Counter Overflow Error Tick status
  * @rmtoll   SR    TCOERR    FL_SENT_IsActiveFlag_TickCounterOverflowErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_TickCounterOverflowErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_TCOERR_Msk) >> SENT_SR_TCOERR_Pos);
}

/**
  * @brief    Clear Tick Counter Overflow Error Tick status
  * @rmtoll   SR    TCOERR    FL_SENT_ClearFlag_TickCounterOverflowErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_TickCounterOverflowErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_TCOERR_Msk);
}

/**
  * @brief    Get Continuous Sync (Successive Sync) length error exceeds the range status
  * @rmtoll   SR    SSERR    FL_SENT_IsActiveFlag_SuccessiveSyncErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_SuccessiveSyncErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_SSERR_Msk) == (SENT_SR_SSERR_Msk));
}

/**
  * @brief    Clear Continuous Sync (Successive Sync) length error exceeds the range status
  * @rmtoll   SR    SSERR    FL_SENT_ClearFlag_SuccessiveSyncErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_SuccessiveSyncErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_SSERR_Msk);
}

