zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_sent.h
/**
  * @brief    Get Nibble Ticks Count error
  * @rmtoll   SR    NBERR    FL_SENT_IsActiveFlag_NibbleTicksCountErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_NibbleTicksCountErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NBERR_Msk) == (SENT_SR_NBERR_Msk));
}

/**
  * @brief    Clear Nibble Ticks Count error
  * @rmtoll   SR    NBERR    FL_SENT_ClearFlag_NibbleTicksCountErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_NibbleTicksCountErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_NBERR_Msk);
}

/**
  * @brief    Get The CRC check error flag
  * @rmtoll   SR    CRCERR    FL_SENT_IsActiveFlag_CRCCheckErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_CRCCheckErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_CRCERR_Msk) == (SENT_SR_CRCERR_Msk));
}

/**
  * @brief    Clear The CRC check error flag
  * @rmtoll   SR    CRCERR    FL_SENT_ClearFlag_CRCCheckErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_CRCCheckErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_CRCERR_Msk);
}

/**
  * @brief    Get The Nibble Number Err State
  * @rmtoll   SR    NCNTERR    FL_SENT_IsActiveFlag_NibblesCountErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_NibblesCountErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NCNTERR_Msk) == (SENT_SR_NCNTERR_Msk));
}

/**
  * @brief    Clear The Nibble Number Err State
  * @rmtoll   SR    NCNTERR    FL_SENT_ClearFlag_NibblesCountErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_NibblesCountErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_NCNTERR_Msk);
}

/**
  * @brief    Get Sync pulse length State
  * @rmtoll   SR    SYNCERR    FL_SENT_IsActiveFlag_SyncPusleWidth
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_SyncPusleWidthErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_SYNCERR_Msk) == (SENT_SR_SYNCERR_Msk));
}

/**
  * @brief    Clear Sync pulse length State
  * @rmtoll   SR    SYNCERR    FL_SENT_ClearFlag_SyncPusleWidth
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_SyncPusleWidthErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_SYNCERR_Msk);
}

/**
  * @brief    Get Frame Transmit completion flag
  * @rmtoll   SR    FTXF    FL_SENT_IsActiveFlag_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_FrameTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_FTXF_Msk) == (SENT_SR_FTXF_Msk));
}

/**
  * @brief    Clear Frame Transmit completion flag
  * @rmtoll   SR    FTXF    FL_SENT_ClearFlag_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_FrameTransmitComplete(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_FTXF_Msk);
}

/**
  * @brief    Get Nibbles Transmit completion flag
  * @rmtoll   SR    NTXF    FL_SENT_IsActiveFlag_NibblesTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_NibblesTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NTXF_Msk) == (SENT_SR_NTXF_Msk));
}

/**
  * @brief    Clear Nibbles Transmit completion flag
  * @rmtoll   SR    NTXF    FL_SENT_ClearFlag_NibblesTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_NibblesTransmitComplete(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_NTXF_Msk);
}

/**
  * @brief    Get Sync Receive Complete flag
  * @rmtoll   SR    SYNCF    FL_SENT_IsActiveFlag_SyncReceiveComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_SyncReceiveComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_SYNCF_Msk) == (SENT_SR_SYNCF_Msk));
}

/**
  * @brief    Clear Sync Receive Complete flag
  * @rmtoll   SR    SYNCF    FL_SENT_ClearFlag_SyncReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_SyncReceiveComplete(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_SYNCF_Msk);
}

/**
  * @brief    Get Frame Receive Complete flag
  * @rmtoll   SR    FRXF    FL_SENT_IsActiveFlag_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_FrameReceiveComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_FRXF_Msk) == (SENT_SR_FRXF_Msk));
}

/**
  * @brief    Clear Frame Receive Complete flag
  * @rmtoll   SR    FRXF    FL_SENT_ClearFlag_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_FrameReceiveComplete(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_FRXF_Msk);
}

/**
  * @brief    Get Nibbles Receive Complete flag
  * @rmtoll   SR    NRXF    FL_SENT_IsActiveFlag_NibblesReceiveComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_NibblesReceiveComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NRXF_Msk) == (SENT_SR_NRXF_Msk));
}

/**
  * @brief    Clear Nibbles Receive Complete flag
  * @rmtoll   SR    NRXF    FL_SENT_ClearFlag_NibblesReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_NibblesReceiveComplete(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_NRXF_Msk);
}

/**
  * @brief    Write CRC nibble
  * @rmtoll   DR    CRC    FL_SENT_WriteNibbleData_CRC
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_CRC(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 28U), (nibble << 28U));
}

/**
  * @brief    Read CRC nibble
  * @rmtoll   DR    CRC    FL_SENT_ReadNibbleData_CRC
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_CRC(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 28U)) >> 28U);
}
/**
  * @brief    Write DATA6 nibble
  * @rmtoll   DR    DATA6    FL_SENT_WriteNibbleData_DATA6
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_DATA6(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 24U), (nibble << 24U));
}

/**
  * @brief    Read DATA6 nibble
  * @rmtoll   DR    DATA6    FL_SENT_ReadNibbleData_DATA6
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_DATA6(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 24U)) >> 24U);
}

/**
  * @brief    Write DATA5 nibble
  * @rmtoll   DR    DATA5    FL_SENT_WriteNibbleData_DATA5
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_DATA5(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 20U), (nibble << 20U));
}

/**
  * @brief    Read DATA5 nibble
  * @rmtoll   DR    DATA5    FL_SENT_ReadNibbleData_DATA5
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_DATA5(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 20U)) >> 20U);
}

/**
  * @brief    Write DATA4 nibble
  * @rmtoll   DR    DATA4    FL_SENT_WriteNibbleData_DATA4
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_DATA4(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 16U), (nibble << 16U));
}

/**
  * @brief    Read DATA4 nibble
  * @rmtoll   DR    DATA4    FL_SENT_ReadNibbleData_DATA4
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_DATA4(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 16U)) >> 16U);
}

/**
  * @brief    Write DATA3 nibble
  * @rmtoll   DR    DATA3    FL_SENT_WriteNibbleData_DATA3
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_DATA3(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 12U), (nibble << 12U));
}

/**
  * @brief    Read DATA3 nibble
  * @rmtoll   DR    DATA3    FL_SENT_ReadNibbleData_DATA3
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_DATA3(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 12U)) >> 12U);
}

/**
  * @brief    Write DATA2 nibble
  * @rmtoll   DR    DATA2    FL_SENT_WriteNibbleData_DATA2
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_DATA2(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 8U), (nibble << 8U));
}

/**
  * @brief    Read DATA2 nibble
  * @rmtoll   DR    DATA2    FL_SENT_ReadNibbleData_DATA2
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_DATA2(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 8U)) >> 8U);
}

/**
  * @brief    Write DATA1 nibble
  * @rmtoll   DR    DATA1    FL_SENT_WriteNibbleData_DATA1
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_DATA1(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 4U), (nibble << 4U));
}

/**
  * @brief    Read DATA1 nibble
  * @rmtoll   DR    DATA1    FL_SENT_ReadNibbleData_DATA1
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_DATA1(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write STATUS nibble
  * @rmtoll   DR    STATUS    FL_SENT_WriteNibbleData_STATUS
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteNibbleData_STATUS(SENT_Type* SENTx, uint32_t nibble)
{
    MODIFY_REG(SENTx->DR, (0xfU << 0U), (nibble << 0U));
}

/**
  * @brief    Read STATUS nibble
  * @rmtoll   DR    STATUS    FL_SENT_ReadNibbleData_STATUS
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadNibbleData_STATUS(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Write DR Register data
  * @rmtoll   DR    FL_SENT_WriteDataRegister
  * @param    SENTx SENT instance
  * @param    nibble 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteDataRegister(SENT_Type* SENTx, uint32_t data)
{
    MODIFY_REG(SENTx->DR, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Read DR Register data
  * @rmtoll   DR    FL_SENT_ReadDataRegister
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadDataRegister(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->DR, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Write the Max Length of Sync
  * @rmtoll   SYNC    SYNCMAX    FL_SENT_WriteSyncMaxLength
  * @param    SENTx SENT instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteSyncMaxLength(SENT_Type* SENTx, uint32_t length)
{
    MODIFY_REG(SENTx->SYNC, (0xfffU << 16U), (length << 16U));
}

/**
  * @brief    Read the Max Length of Sync
  * @rmtoll   SYNC    SYNCMAX    FL_SENT_ReadSyncMaxLength
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadSyncMaxLength(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SYNC, (0xfffU << 16U)) >> 16U);
}

/**
  * @brief    Write the Min Length of Sync
  * @rmtoll   SYNC    SYNCMIN    FL_SENT_WriteSyncMinLength
  * @param    SENTx SENT instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteSyncMinLength(SENT_Type* SENTx, uint32_t length)
{
    MODIFY_REG(SENTx->SYNC, (0xfffU << 0U), (length << 0U));
}

/**
  * @brief    Read the Min Length of Sync
  * @rmtoll   SYNC    SYNCMIN    FL_SENT_ReadSyncMinLength
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadSyncMinLength(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SYNC, (0xfffU << 0U)) >> 0U);
}


/**
  * @brief    Read Sync Base Tick Time
  * @rmtoll   RCAL    BASECNT    FL_SENT_ReadSyncBaseTickTime
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadSyncBaseTickTime(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->RCAL, (0x3fU << 16U)) >> 16U);
}

/**
  * @brief    Read Sync Calibration
  * @rmtoll   RCAL    RCAL    FL_SENT_ReadSyncCalibrationPulse
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadSyncCalibrationPulse(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->RCAL, (0xfffU << 0U)) >> 0U);
}
/**
  * @}
  */

/** @defgroup SENT_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_SENT_DeInit(SENT_Type *SENTx);
FL_ErrorStatus FL_SENT_Init(SENT_Type *SENTx, FL_SENT_InitTypeDef *initStruct);
void FL_SENT_StructInit(FL_SENT_InitTypeDef *initStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FG0XXA_FL_SENT_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-05-11*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
